# -*- coding: utf-8 -*-
# frozen_string_literal: true

require 'utils/range_table'

class DoubleCross
  # 感情表コマンドのノード
  class ET
    # 感情表を振る
    #
    # ポジティブとネガティブの両方を振って、表になっている側に○を付ける。
    #
    # @param [DiceBot] bot ダイスボット
    # @return [String]
    def execute(bot)
      pos_result = POSITIVE_EMOTION_TABLE.roll(bot.bcdice)
      neg_result = NEGATIVE_EMOTION_TABLE.roll(bot.bcdice)

      positive = bot.roll(1, 2)[0] == 1
      pos_neg_text =
        if positive
          ["○#{pos_result.content}", neg_result.content]
        else
          [pos_result.content, "○#{neg_result.content}"]
        end

      parts = [
        "感情表(#{pos_result.sum}-#{neg_result.sum})",
        pos_neg_text.join(' - ')
      ]

      return parts.join(' ＞ ')
    end

    # 感情表（ポジティブ）
    POSITIVE_EMOTION_TABLE = RangeTable.new(
      '感情表（ポジティブ）',
      '1D100',
      [
        # [0, '傾倒(けいとう)'],
        [1..5,    '好奇心(こうきしん)'],
        [6..10,   '憧憬(どうけい)'],
        [11..15,  '尊敬(そんけい)'],
        [16..20,  '連帯感(れんたいかん)'],
        [21..25,  '慈愛(じあい)'],
        [26..30,  '感服(かんぷく)'],
        [31..35,  '純愛(じゅんあい)'],
        [36..40,  '友情(ゆうじょう)'],
        [41..45,  '慕情(ぼじょう)'],
        [46..50,  '同情(どうじょう)'],
        [51..55,  '遺志(いし)'],
        [56..60,  '庇護(ひご)'],
        [61..65,  '幸福感(こうふくかん)'],
        [66..70,  '信頼(しんらい)'],
        [71..75,  '執着(しゅうちゃく)'],
        [76..80,  '親近感(しんきんかん)'],
        [81..85,  '誠意(せいい)'],
        [86..90,  '好意(こうい)'],
        [91..95,  '有為(ゆうい)'],
        [96..100, '尽力(じんりょく)'],
        # [101, '懐旧(かいきゅう)'],
        # [102, '任意(にんい)'],
      ]
    ).freeze

    # 感情表（ネガティブ）
    NEGATIVE_EMOTION_TABLE = RangeTable.new(
      '感情表（ネガティブ）',
      '1D100',
      [
        # [0, '侮蔑(ぶべつ)'],
        [1..5,    '食傷(しょくしょう)'],
        [6..10,   '脅威(きょうい)'],
        [11..15,  '嫉妬(しっと)'],
        [16..20,  '悔悟(かいご)'],
        [21..25,  '恐怖(きょうふ)'],
        [26..30,  '不安(ふあん)'],
        [31..35,  '劣等感(れっとうかん)'],
        [36..40,  '疎外感(そがいかん)'],
        [41..45,  '恥辱(ちじょく)'],
        [46..50,  '憐憫(れんびん)'],
        [51..55,  '偏愛(へんあい)'],
        [56..60,  '憎悪(ぞうお)'],
        [61..65,  '隔意(かくい)'],
        [66..70,  '嫌悪(けんお)'],
        [71..75,  '猜疑心(さいぎしん)'],
        [76..80,  '厭気(いやけ)'],
        [81..85,  '不信感(ふしんかん)'],
        [86..90,  '不快感(ふかいかん)'],
        [91..95,  '憤懣(ふんまん)'],
        [96..100, '敵愾心(てきがいしん)'],
        # [101, '無関心(むかんしん)'],
        # [102, '任意(にんい)'],
      ]
    ).freeze
  end
end
